<template>
    <div class="wrapper">
        <div class="front">
            
<span class="title"> ЖАРИЯ ОФЕРТА ШАРТЫ </span> <br> <br>

ЖК «TORESH» жарғы негізінде әрекет ететін директор  – осы шарт бойынша бірінші тарап Сатушы. Ал екінші тарап Сатып алушы, ол – осы шарттың талаптарын қабылдаған кез келген тұлға. Бұдан әрі бірлесіп Тараптар деп аталатындар осы жария оферта шартын (бұдан әрі — шарт) жасасты. Бұл жария оферта шарты Сатып алушылардың Сатушыдан тауарды (бұдан әрі «тауар») сатып алған кезінде жүзеге асады. Шарт сипаттамасы Сатушының Веб-сайтында https://udb.kz, және/немесе Веб-қосымшасының (әрі қарай «Платформа») тиісті бөлімінде, яғни платформадағы жеке кабинетте орналасқан. Платформаның көмегімен тауар сатуды жүзеге асыратын Сатушы мен сол платформа арқылы тауарға төлем жасаған Сатып алушы осы шарттың төмендегі талаптарын қабылдайды.
<br> <br>
<span class="subTitle"> 1. ЖАЛПЫ ЕРЕЖЕЛЕР </span> <br>
1.1. Сатушы мен Сатып алушы арасындағы шарттық қатынастар жария оферта шарты түрінде ресімделеді. Платформада тауарды сатып алуға арналған тиісті нысанды толтыру арқылы сатып алушы мәртебесіне (жеке тұлға, заңды тұлға, жеке тұлға-кәсіпкер) қарамастан, Қазақстан Республикасының қолданыстағы заңнамасына сәйкес сатып алушының төменде көрсетілген жария оферта шартының талаптарын орындауға келісімін береді.<br>
1.2. Жария оферта шарты жария болып табылады, яғни Қазақстан Республикасы Азаматтық Кодексінің 23-тарауына сәйкес оның талаптары мәртебесіне (жеке тұлға, заңды тұлға, физикалық тұлға-кәсіпкер) қарамастан, барлық сатып алушылар үшін бірдей. Осы шартпен толық келіскен жағдайда, Сатып алушы тауарды сатып алу және оған төлем жасау жөніндегі талаптарды қабылдайды.<br>
1.3. Осы шарт Сатып алушы Сатушыдан тауарды сатып алуға келісім беретін «Картамен төлеу» батырмасын басқан сәттен бастап күшіне енеді және Тараптар өз міндеттемелерін толық орындағанға дейін осы Шарт бойынша әрекет етеді. <br>
1.4. Шарт бойынша шарттық құқықтық қатынастарды реттеу үшін Тараптар Қазақстан Республикасының заңнамасын таңдайды және қажет болған жағдайда қолданады.
<br> <br>
<span class="subTitle"> 2. ТЕРМИНДЕР МЕН АНЫҚТАМАЛАР </span><br>
«Жария оферта шарты» - үлгісі платформада орналастырылған және қолданылуы Сатушы үшін міндетті болып табылатын, платформадағы тауарды сатып алған кез келген Сатып алушыға қатысты ұсынысы бар жария шарт.<br>
«Акцепт» - Сатып алушыдан сипаттамасы платформада орналасқан тауарды сатып алу туралы Сатушының ұсынысын тиісті нысанды толтыру және «Картамен төлеу» батырмасын басу арқылы қабылдауы.<br>
«Сатып алушы» — Қазақстан Республикасының қолданыстағы заңнамасына сәйкес платформаға келген және қандай да бір тауарды сатып алуға ниеті бар кез келген іс-әрекетке қабілетті жеке, заңды тұлға, жеке тұлға-кәсіпкер.<br>
«Сатушы» - Қазақстан Республикасының қолданыстағы заңнамасына сәйкес тауар иесі немесе тауар таратушысы және платформаның көмегімен оны сатуға ниеті бар кез келген іс-әрекетке қабілетті жеке, заңды тұлға, жеке тұлға-кәсіпкер.<br>
«Тауар» - курстар, курстар пакеті, кітаптар немесе платформа арқылы сатылатын кез келген тауар.
<br><br>
<span class="subTitle"> 3. ШАРТТЫҢ МӘНІ </span><br>
3.1. Сатушы осы шартта айқындалған талаптарды тәртіппен орындауға және Сатып алушыға платформада ресімдеген тауарды сатуға міндеттенеді, ал Сатып алушы осы шартта айқындалған талаптарды тәртіппен орындауға және тауарды сатып алуға және ол үшін ақша төлеуге міндеттенеді.<br>
3.2. Сатушы мен Сатып алушы қолданыстағы шарт жалған немесе өтірік мәміле немесе қысым көрсетіп, алдау әсерінен жасалған мәміле емес екенін растайды.<br>
3.3. Сатушы осы Шартты орындау процесінде туындайтын және қолданыстағы құқықтық қатынастар саласын реттейтін шаруашылық қызметті жүзеге асыруға барлық қажетті рұқсаттардың бар екенін растайды, сондай-ақ Қазақстан Республикасының қолданыстағы заңнамасының талаптарына сәйкес тауарды қандай да бір шектеулерсіз өндіруге және/немесе жасауға құқылы екендігіне кепілдік береді. Және осы Шартты орындау процесінде сатып алушының құқықтары бұзылған жағдайда жауапты болуға міндеттенеді.
<br><br>
<span class="subTitle"> 4. САТУШЫНЫҢ ҚҰҚЫҚТАРЫ МЕН МІНДЕТТЕРІ </span><br>
4.1. Сатушы міндетті:<br>
• Осы шарттың талаптарын орындауға;<br>
• Сатып алушыға тауарды таңдалған үлгіге сәйкес платформада және осы Шарттың талаптарына сәйкес беруге;<br>
• Тауарды Платформаға орналастыру кезінде Тауардың сапалық және сандық сипаттамаларын тексеруге.<br>
4.2. Сатушының құқығы бар:<br>
• Сатып алушы осы Шарттың талаптарын бұзған жағдайда осы Шарттың орындалуын біржақты тәртіппен тоқтата тұруына құқығы бар.<br>
4.3. Сатушы:<br>
ЖК «TORESH»<br>
Заңды мекен-жайы / Нақты мекен-жайы: <br>
Қазақстан республикасы, Алматы қаласы, 050000, Қалқаман-2 шағын ауданы, Айбергенова, 75 <br>
Тел: +7 777 479 9292<br>
БСН / ЖСН: 920712401245<br>
БеК / КБЕ: 17<br>
Шот нөмірі: KZ99470398992950461<br>
Банк деректемелері: АО ДБ «Альфа-Банк»<br>
БИК: ALFAKZKA
<br><br>
<span class="subTitle"> 5. САТЫП АЛУШЫНЫҢ ҚҰҚЫҚТАРЫ МЕН МІНДЕТТЕРІ </span><br>
5.1. Сатып алушы міндетті:<br>
• осы Шарттың талаптары бойынша тауарды төлеуге;<br>
• жария оферта шартымен, тауарды сатып алу алдында Платформада орналасқан тауар туралы ақпаратпен танысуға.<br>
5.2. Сатып алушы құқылы:<br>
• сатушыдан осы Шарттың талаптарын орындауды талап етуге құқылы.
<br><br>
<span class="subTitle"> 6. РЕСІМДЕУ ТӘРТІБІ </span><br>
6.1. Сатып алушы тауарды таңдау және «Картамен төлеу» батырмасын басу арқылы тиісті нысанды толтыру жолымен платформада тауарды сатып алуды өз бетімен ресімдейді.<br>
6.2. Тауарды сатып алғаннан кейін Сатып алушының Тауары Жеке кабинетте ашылады.
<br><br>
<span class="subTitle"> 7. ШАРТТЫҢ БАҒАСЫ ЖӘНЕ ТӨЛЕУ ТӘРТІБІ </span><br>
7.1. Әрбір жеке Тауардың бағасын Сатушы анықтайды және ол платформада көрсетіледі.<br>
7.2. Сатып алушы келесі түрдегі несие картасын Тауарды сатып алу кезінде пайдалана алады:<br>
• Visa<br>
• Visa Electron<br>
• Mastercard<br>
• Mastercard Electronic<br>
• Maestro<br>
Ескерту. Сатып алушы төлем картасымен төлеген кезде сол картаның эмитенті қосымша комиссия алуы мүмкін. Сатып алушы Платформадағы «Картамен төлеу» батырмасын басқан кезде, бұл Сатушының Сатып алушыны қосымша комиссия алынуының мүмкін екені туралы хабардар еткенін білдіреді.
<br><br>
<span class="subTitle"> 8. ТӨЛЕМДІ ҚАЙТАРУ ШАРТТАРЫ </span><br>
8.1. Сатушы Сатып алушының жазбаша талабы бойынша тауар сатып алынған күннен бастап 14 (он төрт) күн ішінде, егер ол пайдаланылған болмаса, оның тауарлық түрі, тұтынушылық қасиеттері, заттаңбалары, сондай-ақ тауарды сатып алу фактісін растайтын құжат сақталса, тауар үшін 100% төлемді Сатып алушыға қайтаруға міндеттенеді.
<br><br>
<span class="subTitle"> 9. ТАРАПТАРДЫҢ ЖАУАПКЕРШІЛІГІ ЖӘНЕ ДАУЛАРДЫ ШЕШУ </span><br>
9.1. Тараптар осы Шарттың талаптарын орындамағаны немесе тиісінше орындамағаны үшін осы Шартта және Қазақстан Республикасының қолданыстағы заңнамасында көзделген тәртіппен жауапты болады.<br>
9.2. Сатып алушыдан берешекті өндіріп алу туралы дауларды қоспағанда, осы шартты тараптардың орындауына байланысты даулар туындаған жағдайда, Тараптар оларды шағым тәртібін сақтай отырып, келіссөздер жолымен шешуге міндеттенеді. Шағымды қарау мерзімі – оны алған күннен бастап 7 (жеті) күнтізбелік күн. Сатып алушыдан берешекті өндіріп алуға байланысты даулар бойынша талап ету тәртібін сақтау талап етілмейді.<br>
9.3. Осы Шартқа және оны орындауға, бұзуға, тоқтатуға немесе жарамсыздығына қатысты барлық даулар, келіспеушіліктер немесе талаптар Қазақстан Республикасының материалдық және іс жүргізу құқығына сәйкес тиісті сотта шешілуге жатады.
<br><br>
<span class="subTitle"> 10. ФОРС-МАЖОРЛЫҚ ЖАҒДАЙЛАР </span><br>
10.1. Егер Тараптар осы Шартты жасасқаннан кейін, форс-мажорлық мән-жайлардан немесе Тараптардың бақылауынан тыс іс-шаралардың әсерінен жауапркершіліктерін орындай алмаса және оның сондай мән-жайлардан туындағанын дәлелдесе, Тараптар ақы төлеу жөніндегі міндеттемелерді қоспағанда, өз міндеттемелерінің кез келгенін орындамағаны үшін жауапты болмайды.<br>
Форс-мажорлық жағдайларға атап айтқанда, серверді бұғаттау, табиғи катаклизмдер, ереуілдер, өрт, су тасқыны, жарылыстар, мұз қату, соғыстар (жарияланған және жарияланбаған), бүліктер, апаттар, мемлекеттік органдар салатын шектеулер (бөлуді, ресми талаптарды, квоталарды және бағалық бақылауды қоса алғанда), төтенше жағдай, карантин жатады. Аталған мән-жайлар осы Шартты орындауға тікелей әсер етуі мүмкін.<br>
10.2. Форс-мажорлық жағдайлардың туындауына байланысты осы Шарт бойынша міндеттемелерді орында алмаған Тарап жоғарыда көрсетілген жағдайлардың пайда болуы туралы екінші Тарапқа жазбаша түрде дереу хабарлауға, сондай-ақ 3 (үш) күнтізбелік күн ішінде екінші тарапқа форс-мажорлық жағдайлардың растамасын беруге тиіс. Мұндай растау форс-мажорлық жағдайлар туындаған жерде орналасқан уәкілетті мемлекеттік орган берген анықтама, сертификат немесе басқа да тиісті құжат болады.<br>
10.3. Осы Шарт бойынша өз міндеттемелерін орындау үшін тараптарға талап етілетін уақыт аталған жағдайларға байланысты кез келген мерзімге ұзартылады.<br>
10.4. Егер форс-мажорлық күш мән-жайларының әсерінен осы Шарт бойынша міндеттемелерді орындамау үш айдан астам уақытқа созылса, Тараптардың әрқайсысы бұл туралы екінші Тарапты жазбаша хабардар ете отырып, осы Шартты біржақты тәртіппен бұзуға құқылы. Форс-мажордың туындауына қарамастан, форс-мажорлық жағдайлар салдарынан осы Шартты тоқтату алдында Тараптар түпкілікті өзара есеп айырысуды жүзеге асырады.
<br><br>
<span class="subTitle"> 11. ШАРТТЫҢ БАСҚА ТАЛАПТАРЫ </span><br>
11.1. Сатып алушы ұсынатын ақпарат құпия болып табылады. Сатып алушы туралы ақпарат тек сатып алу (сатушыға тауарды сатып алу туралы хабарлама жіберу, жарнамалық хабарлама жіберу және т.б.) мақсатында ғана пайдаланылады.<br>
11.2. Сатып алушы өзінің дербес деректерін жинауға және өңдеуге ерікті түрде келісім береді Белгілі болған деректер коммерциялық мақсаттарда, оның ішінде телекоммуникациялық байланыс құралдарымен (электрондық пошта, ұялы байланыс) жарнамалық және арнайы ұсыныстарды, акциялар туралы ақпаратты немесе платформадағы қызмет туралы кез келген басқа ақпаратты тарату мақсатында пайдаланылады. Осы тармақта көзделген мақсаттар үшін Сатушы Сатып алушыға e-mail-ға хаттар, хабарламалар мен материалдар жіберуге құқылы, Сондай-ақ sms-хабарламалар жіберіліп, тиісті нысанда көрсетілген телефон нөміріне қоңырау шалу жүзеге асырылуы мүмкін.<br>
11.3. Сатып алушы оның дербес деректерін өңдеуді жүзеге асыруға келісім және құқық береді. Оның ішінде, (бұл туралы қосымша хабарламай), дербес деректерді деректер базасына орналастыруға, деректерді өмір бойы сақтауға, (қажет болса) олардың жинақталуын, жаңартылуын, өзгеруін жүзеге асыруға келісімін береді. Сатушы деректерді үшінші тұлғалардың рұқсатсыз қол жеткізуінен қорғауды қамтамасыз етуге, деректерді кез келген үшінші тарапқа таратпауға және бермеуге (аталған мақсаттар үшін деректерді тікелей өңдеуді жүзеге асыруға сатушы уәкілеттік берген тұлғалар мен құзыретті мемлекеттік органның міндетті сұрау салуынан басқа) міндеттенеді.<br>
11.4. Таратылым алуға тілек білдірмеген жағдайда, Сатып алушы жарнамалық материалдарды алудан бас тарту туралы өтініш жазып, оны пошта немесе электронды мекенжайға жіберіп, Сатушыға жүгінуге құқылы.<br>
11.5. Сатушы тиісті нысанды толтыру кезінде Сатып алушы беретін ақпараттың мазмұны мен дұрыстығына жауапты болмайды.<br>
11.6. Тиісті құқықтар иелерінің алдын ала келісімінсіз Сатып алушы Сатушының жеке кабинетінде орналасқан кез келген материал мен контентті жалпы жұрттың назарына кез келген тәсілмен пайдалануына, таратуына, көшіруіне, көпшілік алдында көрсетуіне, эфирге беруіне, аударуына, қайта жасауына немесе кез келген өзге тәсілмен қандай да бір мақсатта қолдануына тыйым салынады. Сондай-ақ, Сатып алушы Сатушыдан алатын жеке кабинеттің құпия сөзі мен логинін бермеуге, сатпауға, үшінші тұлғаларға таратпауға міндеттенеді.
<br>
        </div>
    </div>
</template>

<script>
import axios from 'axios'
export default {
    name: 'OBJECTIVES',
    methods: {
        async refresh(phone) {
            await axios.get('https://api.udb.kz/users/search/phone/' + phone)
            .then(response => {
                localStorage.setItem('autorize-privilege', response.data.privilege)
                localStorage.setItem('autorize-firstName', response.data.firstName),
                localStorage.setItem('autorize-lastName', response.data.lastName),
                localStorage.setItem('autorize-phone', response.data.phone),
                localStorage.setItem('autorize-password', response.data.password)
            })
        }
    },
    mounted() {
        if (localStorage.getItem('autorize-phone') != null) {
            const user = {
                firstName: localStorage.getItem('autorize-firstName'),
                lastName: localStorage.getItem('autorize-lastName'),
                phone: localStorage.getItem('autorize-phone'),
                privilege: localStorage.getItem('autorize-privilege')
            }
            this.refresh(user.phone)
            this.$emit("autorization", user)
        }
    }
}
</script>

<style lang="sass" scoped>
    @font-face
        font-family: GothamBold
        src: url(../assets/Gotham/GothamBold.ttf)
    
    @font-face
        font-family: GothamLight
        src: url(../assets/Gotham/GothamLight.ttf)
    .wrapper
        width: 100vw
        height: 400vh
        background-color: #000
        .front
            max-width: 1440px
            height: 100%
            margin: 0 auto
            text-align: left
            font-size: 2vh
            font-family: GothamLight
            color: white
            padding-top: 14%
            line-height: 2.5vh
            .title
                color: #FA1451
                font-family: GothamBold
            .subTitle
                color: white
                font-family: GothamBold
</style>